GabyGold67/ButtonToSwitch_STM32/src/ButtonToSwitch_STM32.cpp
void DbncdMPBttn::clrStatus(bool clrIsOn){
	/*To Resume operations after a pause() without risking generating false "Valid presses" and "On" situations,
	several attributes must be reseted to "Start" values
	The only important value not reseted is the _mpbFdaState, to do it call resetFda() INSTEAD of this method*/

	taskENTER_CRITICAL();
	_isPressed = false;
	_validPressPend = false;
	_validReleasePend = false;
	_dbncTimerStrt = 0;
	_dbncRlsTimerStrt = 0;
	if(clrIsOn){
		if(_isOn){
			_turnOff();
		}
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::clrSttChng(){
	_sttChng = false;

	return;
}

void DbncdMPBttn::disable(){

    return _setIsEnabled(false);
}

void DbncdMPBttn::enable(){

    return _setIsEnabled(true);
}

bool DbncdMPBttn::end(){
	bool result {false};
   BaseType_t tmrModResult {pdFAIL};

   if (_mpbPollTmrHndl){
   	result = pause();
      if (result){
      	tmrModResult = xTimerDelete(_mpbPollTmrHndl, portMAX_DELAY);
			if (tmrModResult == pdPASS){
				_mpbPollTmrHndl = NULL;
			}
			else{
				result = false;
			}
      }
   }

   return result;
}

const unsigned long int DbncdMPBttn::getCurDbncTime() const{

	return _dbncTimeTempSett;
}

fncPtrType DbncdMPBttn::getFnWhnTrnOff(){

	return _fnWhnTrnOff;
}

fncPtrType DbncdMPBttn::getFnWhnTrnOn(){

	return _fnWhnTrnOn;
}

const bool DbncdMPBttn::getIsEnabled() const{

    return _isEnabled;
}

const bool DbncdMPBttn::getIsOn() const {

	return _isOn;
}

const bool DbncdMPBttn::getIsOnDisabled() const{

    return _isOnDisabled;
}

const bool DbncdMPBttn::getIsPressed() const {

	return _isPressed;
}

const uint32_t DbncdMPBttn::getOtptsSttsPkgd(){

	return _otptsSttsPkg();
}

const bool DbncdMPBttn::getOutputsChange() const{

    return _outputsChange;
}

unsigned long int DbncdMPBttn::getStrtDelay(){

	return _strtDelay;
}

const TaskHandle_t DbncdMPBttn::getTaskToNotify() const{

    return _taskToNotifyHndl;
}

const TaskHandle_t DbncdMPBttn::getTaskWhileOn(){

	return _taskWhileOnHndl;
}

bool DbncdMPBttn::init(GPIO_TypeDef* mpbttnPort, const uint16_t &mpbttnPin, const bool &pulledUp, const bool &typeNO, const unsigned long int &dbncTimeOrigSett){
    bool result {false};

    if (_mpbPollTmrName == ""){
		_mpbttnPin = mpbttnPin;
		_pulledUp = pulledUp;
		_typeNO = typeNO;
		_dbncTimeOrigSett = dbncTimeOrigSett;

      std::string mpbPollTmrName{ "PollMpbPin" };
      std::string mpbPinNumStr{ "00" + std::to_string(singleBitPosNum(_mpbttnPin)) };


  		if(mpbttnPort == GPIOA){
			mpbPollTmrName += "A";
  			__HAL_RCC_GPIOA_CLK_ENABLE();	//Sets the bit in the GPIO enabled clocks register, by logic OR of the corresponding bit, no problem if already set, macro adds time to get the clk running
  		}
  		else if(mpbttnPort == GPIOB){
			mpbPollTmrName += "B";
  			__HAL_RCC_GPIOB_CLK_ENABLE();
  		}
#ifdef GPIOC
  		else if(mpbttnPort == GPIOC){
  			mpbPollTmrName += "C";
  			__HAL_RCC_GPIOC_CLK_ENABLE();
  		}
#endif
#ifdef GPIOD
  		else if(mpbttnPort == GPIOD){
  			mpbPollTmrName += "D";
  			__HAL_RCC_GPIOD_CLK_ENABLE();
  		}
#endif
#ifdef GPIOE
  		else if(mpbttnPort == GPIOE){
  			mpbPollTmrName += "E";
  			__HAL_RCC_GPIOE_CLK_ENABLE();
  		}
#endif
#ifdef GPIOF
  		else if(mpbttnPort == GPIOF){	//Port not present in all STM32 MCUs/DevBoards
  			mpbPollTmrName += "F";
  			__HAL_RCC_GPIOF_CLK_ENABLE();
  		}
#endif
#ifdef GPIOG
  		else if(mpbttnPort == GPIOG){	//Port not present in all STM32 MCUs/DevBoards
  			mpbPollTmrName += "G";
  			__HAL_RCC_GPIOG_CLK_ENABLE();
  		}
#endif
#ifdef GPIOH
  		else if(mpbttnPort == GPIOH){	//Port not present in all STM32 MCUs/DevBoards
  			mpbPollTmrName += "H";
  			__HAL_RCC_GPIOH_CLK_ENABLE();
  		}
#endif
#ifdef GPIOI
  		else if(mpbttnPort == GPIOI){	//Port not present in all STM32 MCUs/DevBoards
  			mpbPollTmrName += "I";
  			__HAL_RCC_GPIOI_CLK_ENABLE();
  }
#endif

		mpbPinNumStr = mpbPinNumStr.substr(mpbPinNumStr.length() - 2, 2);

		_mpbPollTmrName = _mpbPollTmrName + mpbPinNumStr + "_tmr";

        if(_dbncTimeOrigSett < _stdMinDbncTime) 	// Best practice would impose failing the constructor (throwing an exeption or building a "zombie" object)
            _dbncTimeOrigSett = _stdMinDbncTime;    //this tolerant approach taken for developers benefit, but object will be no faithful to the instantiation parameters
        _dbncTimeTempSett = _dbncTimeOrigSett;
        _dbncRlsTimeTempSett = _stdMinDbncTime;	//The Release debouncing time parameter is kept to the minimum empirical value

        GPIO_InitTypeDef GPIO_InitStruct = {0};
    		/*Configure GPIO pin : tstMPBttn_Pin */
    		GPIO_InitStruct.Pin = _mpbttnPin;
    		GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    		GPIO_InitStruct.Pull = (_pulledUp == true)?GPIO_PULLUP:GPIO_PULLDOWN;
    		HAL_GPIO_Init(_mpbttnPort, &GPIO_InitStruct);
			result = true;
    }

    return result;
}

bool DbncdMPBttn::init(gpioPinId_t mpbttnPinStrct, const bool &pulledUp, const bool &typeNO, const unsigned long int &dbncTimeOrigSett){

	return init(mpbttnPinStrct.portId, mpbttnPinStrct.pinNum, pulledUp, typeNO, dbncTimeOrigSett);
}

void DbncdMPBttn::mpbPollCallback(TimerHandle_t mpbTmrCbArg){
	DbncdMPBttn* mpbObj = (DbncdMPBttn*)pvTimerGetTimerID(mpbTmrCbArg);
	BaseType_t xReturned;

	taskENTER_CRITICAL();
	if(mpbObj->getIsEnabled()){
		// Input/Output signals update
		mpbObj->updIsPressed();
		// Flags/Triggers calculation & update
		mpbObj->updValidPressesStatus();
	}
	// State machine status update
	mpbObj->updFdaState();
	taskEXIT_CRITICAL();

	if (mpbObj->getOutputsChange()){	//Output changes might happen as part of the updFdaState() execution
		if(mpbObj->getTaskToNotify() != NULL){
			xReturned = xTaskNotify(
					mpbObj->getTaskToNotify(),	//TaskHandle_t of the task receiving notification
					static_cast<unsigned long>(mpbObj->getOtptsSttsPkgd()),
					eSetValueWithOverwrite	//In this specific case using eSetBits is also a valid option
					);
			 if (xReturned != pdPASS){
				 errorFlag = pdTRUE;
			 }
			 mpbObj->setOutputsChange(false);	//If the outputsChange triggers a task to treat it, here's  the flag reset, in other cases the mechanism reading the chganges must take care of the flag status
		}
	}

	return;
}

uint32_t DbncdMPBttn::_otptsSttsPkg(uint32_t prevVal){
	if(_isOn){
		prevVal |= ((uint32_t)1) << IsOnBitPos;
	}
	else{
		prevVal &= ~(((uint32_t)1) << IsOnBitPos);
	}
	if(_isEnabled){
		prevVal |= ((uint32_t)1) << IsEnabledBitPos;
	}
	else{
		prevVal &= ~(((uint32_t)1) << IsEnabledBitPos);
	}

