GabyGold67/ButtonToSwitch_STM32/src/ButtonToSwitch_STM32.cpp
	return prevVal;
}

bool DbncdMPBttn::pause(){
    bool result {false};
    BaseType_t tmrModResult {pdFAIL};

    if (_mpbPollTmrHndl){
   	 if (xTimerIsTimerActive(_mpbPollTmrHndl)){
   		 tmrModResult = xTimerStop(_mpbPollTmrHndl, portMAX_DELAY);
   		 if (tmrModResult == pdPASS)
   			 result = true;
   	 }
    }
    else{
   	 result = true;
    }

    return result;
}

void DbncdMPBttn::resetDbncTime(){
	setDbncTime(_dbncTimeOrigSett);

    return;
}

void DbncdMPBttn::resetFda(){
	taskENTER_CRITICAL();
	clrStatus();
	setSttChng();
	_mpbFdaState = stOffNotVPP;
	taskEXIT_CRITICAL();

	return;
}

bool DbncdMPBttn::resume(){
	bool result {false};
	BaseType_t tmrModResult {pdFAIL};

	resetFda();	//To restart in a safe situation the FDA is resetted to have all flags and timers cleaned up

	if (_mpbPollTmrHndl){
		if (xTimerIsTimerActive(_mpbPollTmrHndl) == pdFAIL){	// This enforces the timer to be stopped to let the timer be resumed, makes the method useless just to reset the timer counter
			tmrModResult = xTimerReset( _mpbPollTmrHndl, portMAX_DELAY);
			if (tmrModResult == pdPASS)
				result = true;
		}
	}

	return result;
}

bool DbncdMPBttn::setDbncTime(const unsigned long int &newDbncTime){
    bool result {true};

    taskENTER_CRITICAL();
    if(_dbncTimeTempSett != newDbncTime){
		 if (newDbncTime >= _stdMinDbncTime){
			  _dbncTimeTempSett = newDbncTime;
		 }
		 else{
			  result = false;
		 }
    }
    taskEXIT_CRITICAL();

    return result;
}

void DbncdMPBttn::setFnWhnTrnOffPtr(void (*newFnWhnTrnOff)()){
	taskENTER_CRITICAL();
	if (_fnWhnTrnOff != newFnWhnTrnOff){
		_fnWhnTrnOff = newFnWhnTrnOff;
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::setFnWhnTrnOnPtr(void (*newFnWhnTrnOn)()){
	taskENTER_CRITICAL();
	if (_fnWhnTrnOn != newFnWhnTrnOn){
		_fnWhnTrnOn = newFnWhnTrnOn;
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::_setIsEnabled(const bool &newEnabledValue){
	taskENTER_CRITICAL();
	if(_isEnabled != newEnabledValue){
		if (newEnabledValue){  //Change to Enabled = true
			_validEnablePend = true;
			if(_validDisablePend)
				_validDisablePend = false;
		}
		else{	//Change to Enabled = false  (i.e. Disabled)
			_validDisablePend = true;
			if(_validEnablePend)
				_validEnablePend = false;
		}
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::setIsOnDisabled(const bool &newIsOnDisabled){
	taskENTER_CRITICAL();
	if(_isOnDisabled != newIsOnDisabled){
		_isOnDisabled = newIsOnDisabled;
		if(!_isEnabled){
			if(_isOn != _isOnDisabled){
				if(_isOnDisabled){
					_turnOn();
				}
				else{
					_turnOff();
				}
			}
		}
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::setOutputsChange(bool newOutputsChange){
	taskENTER_CRITICAL();
	if(_outputsChange != newOutputsChange)
   	_outputsChange = newOutputsChange;
	taskEXIT_CRITICAL();

   return;
}

void DbncdMPBttn::setSttChng(){
	_sttChng = true;

	return;
}

void DbncdMPBttn::setTaskToNotify(const TaskHandle_t &newTaskHandle){
	eTaskState taskWhileOnStts{};

	 taskENTER_CRITICAL();
		if(_taskToNotifyHndl != newTaskHandle){
			if(_taskToNotifyHndl != NULL){
				taskWhileOnStts = eTaskGetState(_taskToNotifyHndl);
				if (taskWhileOnStts != eSuspended){
					if(taskWhileOnStts != eDeleted){
						vTaskSuspend(_taskToNotifyHndl);
						_taskToNotifyHndl = NULL;
					}
				}
			}
			if (newTaskHandle != NULL){
				_taskToNotifyHndl = newTaskHandle;
			}
		}
    taskEXIT_CRITICAL();

    return;
}

void DbncdMPBttn::setTaskWhileOn(const TaskHandle_t &newTaskHandle){
	eTaskState taskWhileOnStts{};

	taskENTER_CRITICAL();
	if(_taskWhileOnHndl != newTaskHandle){
		if(_taskWhileOnHndl != NULL){
			taskWhileOnStts = eTaskGetState(_taskWhileOnHndl);
			if (taskWhileOnStts != eSuspended){
				if(taskWhileOnStts != eDeleted){
					vTaskSuspend(_taskWhileOnHndl);
					_taskWhileOnHndl = NULL;
				}
			}
		}
		if (newTaskHandle != NULL){
			_taskWhileOnHndl = newTaskHandle;
		}
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::_turnOff(){
	if(_isOn){
		//---------------->> Tasks related actions
		if(_taskWhileOnHndl != NULL){
			eTaskState taskWhileOnStts{eTaskGetState(_taskWhileOnHndl)};
			if (taskWhileOnStts != eSuspended){
				if(taskWhileOnStts != eDeleted){
					vTaskSuspend(_taskWhileOnHndl);
				}
			}
		}
		//---------------->> Functions related actions
		if(_fnWhnTrnOff != nullptr){
			_fnWhnTrnOff();
		}
	}

	taskENTER_CRITICAL();
	if(_isOn){
		//---------------->> Flags related actions
		_isOn = false;
		_outputsChange = true;
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::_turnOn(){
	if(!_isOn){
		//---------------->> Tasks related actions
		if(_taskWhileOnHndl != NULL){
			eTaskState taskWhileOnStts{eTaskGetState(_taskWhileOnHndl)};
			if(taskWhileOnStts != eDeleted){
				if (taskWhileOnStts == eSuspended){
					vTaskResume(_taskWhileOnHndl);
				}
			}
		}
		//---------------->> Functions related actions
		if(_fnWhnTrnOn != nullptr){
			_fnWhnTrnOn();
		}
	}

	taskENTER_CRITICAL();
	if(!_isOn){
		//---------------->> Flags related actions
		_isOn = true;
		_outputsChange = true;
	}
	taskEXIT_CRITICAL();

	return;
}

void DbncdMPBttn::updFdaState(){
	taskENTER_CRITICAL();
	switch(_mpbFdaState){
		case stOffNotVPP:
			//In: >>---------------------------------->>
			if(_sttChng){
				clrStatus(true);
				clrSttChng();
			}	// Execute this code only ONCE, when entering this state
			//Do: >>---------------------------------->>
			if(_validPressPend){
				_mpbFdaState = stOffVPP;
				setSttChng();	//Set flag to execute exiting OUT code
			}
			if(_validDisablePend){
				_mpbFdaState = stDisabled;
				setSttChng();	//Set flag to execute exiting OUT code
			}
			//Out: >>---------------------------------->>
			if(_sttChng){}	// Execute this code only ONCE, when exiting this state
			break;

		case stOffVPP:
			//In: >>---------------------------------->>
			if(_sttChng){clrSttChng();}	// Execute this code only ONCE, when entering this state
			//Do: >>---------------------------------->>
			if(!_isOn){
				_turnOn();
			}
			_validPressPend = false;
			_mpbFdaState = stOn;
			setSttChng();
			//Out: >>---------------------------------->>
			if(_sttChng){}	// Execute this code only ONCE, when exiting this state
			break;

		case stOn:
			//In: >>---------------------------------->>
			if(_sttChng){clrSttChng();}	// Execute this code only ONCE, when entering this state
			//Do: >>---------------------------------->>
			if(_validReleasePend){
				_mpbFdaState = stOnVRP;
				setSttChng();
			}
			if(_validDisablePend){
				_mpbFdaState = stDisabled;
				setSttChng();	//Set flag to execute exiting OUT code
			}
			//Out: >>---------------------------------->>
			if(_sttChng){}	// Execute this code only ONCE, when exiting this state
			break;

