GabyGold67/ButtonToSwitch_STM32/src/ButtonToSwitch_STM32.cpp
	return prevVal;
}

void HntdTmLtchMPBttn::clrStatus(bool clrIsOn){
//	Put here class specific sets/resets, including pilot and warning
	taskENTER_CRITICAL();
	_validWrnngSetPend = false;
	_validWrnngResetPend = false;
	_validPilotSetPend = false;
	_validPilotResetPend = false;
	TmLtchMPBttn::clrStatus(clrIsOn);
	taskEXIT_CRITICAL();

	return;
}

fncPtrType HntdTmLtchMPBttn::getFnWhnTrnOffPilot(){

	return _fnWhnTrnOffPilot;
}

fncPtrType HntdTmLtchMPBttn::getFnWhnTrnOnPilot(){

	return _fnWhnTrnOnPilot;
}

fncPtrType HntdTmLtchMPBttn::getFnWhnTrnOffWrnng(){

	return _fnWhnTrnOffWrnng;
}

fncPtrType HntdTmLtchMPBttn::getFnWhnTrnOnWrnng(){

	return _fnWhnTrnOnWrnng;
}

const bool HntdTmLtchMPBttn::getPilotOn() const{

    return _pilotOn;
}

const bool HntdTmLtchMPBttn::getWrnngOn() const{

    return _wrnngOn;
}

void HntdTmLtchMPBttn::mpbPollCallback(TimerHandle_t mpbTmrCbArg){
	HntdTmLtchMPBttn* mpbObj = (HntdTmLtchMPBttn*)pvTimerGetTimerID(mpbTmrCbArg);

	taskENTER_CRITICAL();
	if(mpbObj->getIsEnabled()){
		// Input/Output signals update
		mpbObj->updIsPressed();
		// Flags/Triggers calculation & update
		mpbObj->updValidPressesStatus();
		mpbObj->updValidUnlatchStatus();
		mpbObj->updWrnngOn();
		mpbObj->updPilotOn();
	}
 	// State machine state update
 	mpbObj->updFdaState();
 	taskEXIT_CRITICAL();

	if (mpbObj->getOutputsChange()){
		if(mpbObj->getTaskToNotify() != NULL){
			xTaskNotify(
					mpbObj->getTaskToNotify(),	//TaskHandle_t of the task receiving notification
					static_cast<unsigned long>(mpbObj->getOtptsSttsPkgd()),
					eSetValueWithOverwrite
			);
			mpbObj->setOutputsChange(false);
		}
	}

	return;
}

void HntdTmLtchMPBttn::setFnWhnTrnOffPilotPtr(void(*newFnWhnTrnOff)()){
	taskENTER_CRITICAL();
	if (_fnWhnTrnOffPilot != newFnWhnTrnOff){
		_fnWhnTrnOffPilot = newFnWhnTrnOff;
	}
	taskEXIT_CRITICAL();

	return;
}

void HntdTmLtchMPBttn::setFnWhnTrnOnPilotPtr(void(*newFnWhnTrnOn)()){
	taskENTER_CRITICAL();
	if (_fnWhnTrnOnPilot != newFnWhnTrnOn){
		_fnWhnTrnOnPilot = newFnWhnTrnOn;
	}
	taskEXIT_CRITICAL();

	return;
}

void HntdTmLtchMPBttn::setFnWhnTrnOffWrnngPtr(void(*newFnWhnTrnOff)()){
	taskENTER_CRITICAL();
	if (_fnWhnTrnOffWrnng != newFnWhnTrnOff){
		_fnWhnTrnOffWrnng = newFnWhnTrnOff;
	}
	taskEXIT_CRITICAL();

	return;
}

void HntdTmLtchMPBttn::setFnWhnTrnOnWrnngPtr(void(*newFnWhnTrnOn)()){
	taskENTER_CRITICAL();
	if (_fnWhnTrnOnWrnng != newFnWhnTrnOn){
		_fnWhnTrnOnWrnng = newFnWhnTrnOn;
	}
	taskEXIT_CRITICAL();

	return;
}

void HntdTmLtchMPBttn::setKeepPilot(const bool &newKeepPilot){
	taskENTER_CRITICAL();
	if(_keepPilot != newKeepPilot)
		_keepPilot = newKeepPilot;
	taskEXIT_CRITICAL();

	return;
}

bool HntdTmLtchMPBttn::setSrvcTime(const unsigned long int &newSrvcTime){
	bool result {true};

	taskENTER_CRITICAL();
	if (newSrvcTime != _srvcTime){
		result = TmLtchMPBttn::setSrvcTime(newSrvcTime);
		if (result)
			_wrnngMs = (_srvcTime * _wrnngPrctg) / 100;  //If the _srvcTime was changed, the _wrnngMs must be updated as it's a percentage of the first
	}
	taskEXIT_CRITICAL();

	return result;
}

bool HntdTmLtchMPBttn::setWrnngPrctg (const unsigned int &newWrnngPrctg){
	bool result{false};

	taskENTER_CRITICAL();
	if(_wrnngPrctg != newWrnngPrctg){
		if(newWrnngPrctg <= 100){
			_wrnngPrctg = newWrnngPrctg;
			_wrnngMs = (_srvcTime * _wrnngPrctg) / 100;
			result = true;
		}
	}
	taskEXIT_CRITICAL();

	return result;
}

void HntdTmLtchMPBttn::stOffNotVPP_In(){
	//This method is invoked exclusively from the updFdaState, no need to declare it critical section
	if(_keepPilot){
		if(!_pilotOn){
			_turnOnPilot();	// _pilotOn = true;
			_outputsChange = true;
		}
	}
	if(_wrnngOn){
		_turnOffWrnng();	// _wrnngOn = false;
		_outputsChange = true;
	}

	return;
}

void HntdTmLtchMPBttn::stOffVPP_Out(){
	//This method is invoked exclusively from the updFdaState, no need to declare it critical section
	TmLtchMPBttn::stOffVPP_Out();
	if(_pilotOn){
		_turnOffPilot();	// _pilotOn = false;
		_outputsChange = true;
	}

	return;
}

void HntdTmLtchMPBttn::stOnNVRP_Do(){
	//This method is invoked exclusively from the updFdaState, no need to declare it critical section
	if(_validWrnngSetPend){
		_turnOnWrnng();	// _wrnngOn = true;
		_validWrnngSetPend = false;
		_outputsChange = true;
	}
	if(_validWrnngResetPend){
		_turnOffWrnng();	// _wrnngOn = false;
		_validWrnngResetPend = false;
		_outputsChange = true;
	}

	return;
}

void HntdTmLtchMPBttn::stLtchNVUP_Do(){
	//This method is invoked exclusively from the updFdaState, no need to declare it critical section
	if(_validWrnngSetPend){
		_turnOnWrnng();	// _wrnngOn = true;
		_validWrnngSetPend = false;
		_outputsChange = true;
	}
	if(_validWrnngResetPend){
		_turnOffWrnng();	// _wrnngOn = false;
		_validWrnngResetPend = false;
		_outputsChange = true;
	}

	return;
}

void HntdTmLtchMPBttn::stDisabled_In(){
	//This method is invoked exclusively from the updFdaState, no need to declare it critical section
	if(_validWrnngSetPend)
		_validWrnngSetPend = false;
	if(_validWrnngResetPend)
		_validWrnngResetPend = false;
	if(_wrnngOn){
		_turnOffWrnng();	// _wrnngOn = false;
		_outputsChange = true;
	}

	if(_validPilotSetPend)
		_validPilotSetPend = false;
	if(_validPilotResetPend)
		_validPilotResetPend = false;
	if(_keepPilot && !_isOnDisabled && !_pilotOn){
		_turnOnPilot();	// _pilotOn = true;
		_outputsChange = true;
	}
	else if(_pilotOn == true)
		_turnOffPilot();	// _pilotOn = false;

	return;
}

void HntdTmLtchMPBttn::_turnOffPilot(){
	if(_pilotOn){
		//---------------->> Tasks related actions
		/*
		if(_taskWhileOnHndl != NULL){
			eTaskState taskWhileOnStts{eTaskGetState(_taskWhileOnHndl)};
			if (taskWhileOnStts != eSuspended){
				if(taskWhileOnStts != eDeleted){
					vTaskSuspend(_taskWhileOnHndl);
				}
			}
		}
		*/
		//---------------->> Functions related actions
		if(_fnWhnTrnOffPilot != nullptr){
			_fnWhnTrnOffPilot();
		}
	}
	taskENTER_CRITICAL();
	if(_pilotOn){
		//---------------->> Flags related actions
		_pilotOn = false;
		_outputsChange = true;
	}
	taskEXIT_CRITICAL();

	return;
}

void HntdTmLtchMPBttn::_turnOnPilot(){
	if(!_pilotOn){
		//---------------->> Tasks related actions
		/*
		if(_taskWhileOnHndl != NULL){
			eTaskState taskWhileOnStts{eTaskGetState(_taskWhileOnHndl)};
			if (taskWhileOnStts != eSuspended){
				if(taskWhileOnStts != eDeleted){
					vTaskSuspend(_taskWhileOnHndl);
				}
			}
		}
		*/
		//---------------->> Functions related actions
		if(_fnWhnTrnOnPilot != nullptr){
			_fnWhnTrnOnPilot();
		}
	}
	taskENTER_CRITICAL();
	if(!_pilotOn){
		//---------------->> Flags related actions
		_pilotOn = true;
		_outputsChange = true;
	}
	taskEXIT_CRITICAL();

	return;
}

void HntdTmLtchMPBttn::_turnOffWrnng(){
	if(_wrnngOn){
		//---------------->> Tasks related actions
		/*
		if(_taskWhileOnHndl != NULL){
			eTaskState taskWhileOnStts{eTaskGetState(_taskWhileOnHndl)};
			if (taskWhileOnStts != eSuspended){
				if(taskWhileOnStts != eDeleted){
					vTaskSuspend(_taskWhileOnHndl);
				}
			}
		}
		*/
		//---------------->> Functions related actions
		if(_fnWhnTrnOffWrnng != nullptr){
			_fnWhnTrnOffWrnng();
		}
	}
	taskENTER_CRITICAL();
	if(_wrnngOn){
		//---------------->> Flags related actions
		_wrnngOn = false;
		_outputsChange = true;
	}
	taskEXIT_CRITICAL();

	return;
}

void HntdTmLtchMPBttn::_turnOnWrnng(){
	if(!_wrnngOn){
		//---------------->> Tasks related actions
		/*
		if(_taskWhileOnHndl != NULL){
			eTaskState taskWhileOnStts{eTaskGetState(_taskWhileOnHndl)};
			if (taskWhileOnStts != eSuspended){
				if(taskWhileOnStts != eDeleted){
					vTaskSuspend(_taskWhileOnHndl);
				}
			}
		}
		*/
		//---------------->> Functions related actions
		if(_fnWhnTrnOnWrnng != nullptr){
			_fnWhnTrnOnWrnng();
		}
	}
	taskENTER_CRITICAL();
	if(!_wrnngOn){
		//---------------->> Flags related actions
		_wrnngOn = true;
		_outputsChange = true;
	}
	taskEXIT_CRITICAL();

	return;
}

